#include "common.h"
#include "effects.h"
#include "entity.h"
#include "battle/battle.h"
#include "battle/action_cmd.h"
#include <stdlib.h>

typedef struct BonkData {
    /* 0x00 */ b32 alive;
    /* 0x04 */ s32 entityModelIndex;
    /* 0x08 */ Vec3f accel;
    /* 0x14 */ Vec3f vel;
    /* 0x20 */ s32 moveTime;
    /* 0x24 */ s32 startupTime;
    /* 0x28 */ f32 rotZ;
    /* 0x2C */ f32 rotVelZ;
    /* 0x30 */ f32 rotY;
    /* 0x34 */ f32 scale;
    /* 0x38 */ Vec3f pos;
    /* 0x44 */ s32 holdTime;
    /* 0x48 */ f32 alpha; // unused
} BonkData; // size = 0x4C

#if VERSION_JP
extern s32* D_8028358C[];

s32* D_8028358C_2[] = {
    (s32*)D_8028358C, (s32*)D_8028358C, (s32*)D_8028358C
};

s8 D_8028374C_1BA13C[][4] = {
    { 236, 0, 0, 0 }, { 204, 0, 0, 0 }, { 238, 0, 0, 0 }, { 248, 0, 0, 0 }, { 252, 0, 0, 0 },
    { 252, 0, 0, 0 }, { 252, 0, 0, 0 }, { 252, 0, 0, 0 }, {   0, 0, 0, 0 }, {   0, 0, 0, 0 },
    { 248, 0, 0, 0 }, { 248, 0, 0, 0 }, { 248, 0, 0, 0 }, { 248, 0, 0, 0 }, { 248, 0, 0, 0 },
    { 248, 0, 0, 0 }, { 248, 0, 0, 0 }, { 248, 0, 0, 0 }, { 248, 0, 0, 0 }, { 248, 0, 0, 0 },
    { 248, 0, 0, 0 }, { 248, 0, 0, 0 }, { 248, 0, 0, 0 }, { 248, 0, 0, 0 }, { 248, 0, 0, 0 },
    { 248, 0, 0, 0 }, { 248, 0, 0, 0 }, { 248, 0, 0, 0 }, { 248, 0, 0, 0 }, { 248, 0, 0, 0 },
    { 248, 0, 0, 0 }, { 248, 0, 0, 0 }, { 248, 0, 0, 0 }, { 248, 0, 0, 0 }, { 248, 0, 0, 0 },
    { 248, 0, 0, 0 }, { 248, 0, 0, 0 }, { 248, 0, 0, 0 }, { 248, 0, 0, 0 }, { 248, 0, 0, 0 },
